-*- mode: org -*-
#+STARTUP: indent hidestars showall

* jq with_entries
https://stackoverflow.com/questions/40923539/jq-filtering-for-keys
#+name: activities-json
#+begin_example 
  {
      "activities" : {
        "-KSndgjqvmQkWVKHCpLh" : {
        "create_device" : "...",
        "stop_time_utc" : "2016-11-01T23:08:08Z"
      },
        "-KSoBSrBh6PZcjRocGD7" : {
        "create_device" : "..."
      },
        "-KSptboGjo8g4bieUbGM" : {
        "create_device" : "...",
        "stop_time_utc" : "2017-01-17T23:08:08Z"
      }  
    }
  }
#+end_example

#+header: :stdin activities-json
#+begin_src shell 
jq .activities
#+end_src

#+RESULTS:
| {                    |                      |
| -KSndgjqvmQkWVKHCpLh | {                    |
| create_device        | ...                  |
| stop_time_utc        | 2016-11-01T23:08:08Z |
| },                   |                      |
| -KSoBSrBh6PZcjRocGD7 | {                    |
| create_device        | ...                  |
| },                   |                      |
| -KSptboGjo8g4bieUbGM | {                    |
| create_device        | ...                  |
| stop_time_utc        | 2017-01-17T23:08:08Z |
| }                    |                      |
| }                    |                      |

#+header: :stdin activities-json
#+begin_src bash 
jq '.activities | keys'
#+end_src

#+RESULTS:
| [                    |
| -KSndgjqvmQkWVKHCpLh |
| -KSoBSrBh6PZcjRocGD7 |
| -KSptboGjo8g4bieUbGM |
| ]                    |

#+header: :stdin activities-json
#+begin_src bash 
jq '.activities | with_entries( select(.value | has("stop_time_utc")))'
#+end_src

#+RESULTS:
| {                    |                      |
| -KSndgjqvmQkWVKHCpLh | {                    |
| create_device        | ...                  |
| stop_time_utc        | 2016-11-01T23:08:08Z |
| },                   |                      |
| -KSptboGjo8g4bieUbGM | {                    |
| create_device        | ...                  |
| stop_time_utc        | 2017-01-17T23:08:08Z |
| }                    |                      |
| }                    |                      |

#+header: :stdin activities-json
#+begin_src bash
jq '.activities | with_entries( select( (.value.stop_time_utc? | fromdateiso8601?) < now ) ) | keys'
#+end_src

#+RESULTS:
| [                    |
| -KSndgjqvmQkWVKHCpLh |
| -KSptboGjo8g4bieUbGM |
| ]                    |

** example 2
#+name: key-json
#+begin_example
  {
   "key11":1010,"key11_yes":13,"key11_no":14,
   "key12":12120,"key12_yes":9,"key12_no":25,
   "key13":12103,"key13_yes":13,"key13_no":20
  }
#+end_example

#+header: :stdin key-json
#+begin_src bash
jq -e 'with_entries(if (.key|test("key[0-9][0-9]$")) then ({key: .key, value: .value}) else empty end)'
#+end_src

#+RESULTS:
| {     |        |
| key11 | 1010,  |
| key12 | 12120, |
| key13 | 12103  |
| }     |        |

#+header: :stdin key-json
#+begin_src bash
mapfile -t arr < <(jq -r 'keys[]'); for i in "${arr[@]}"; do if [[ $i =~ ^key[1-9][2-3](_yes|_no)? ]]; then echo $i 1; else echo $i 2; fi; done 
#+end_src

#+RESULTS:
| key11     | 2 |
| key11_no  | 2 |
| key11_yes | 2 |
| key12     | 1 |
| key12_no  | 1 |
| key12_yes | 1 |
| key13     | 1 |
| key13_no  | 1 |
| key13_yes | 1 |

- redirecting output to a file
  https://askubuntu.com/questions/797129/command-output-redirection-using

- mapping lines of the file to an array
  mapfile -t arr < <(process)

- from processing json with jq 
  https://unix.stackexchange.com/questions/444915/process-json-format-with-jq-tools

* more bash coolness
http://mywiki.wooledge.org/BashFAQ/001

#+begin_src bash
  while IFS= read -r line; do arr+=("$line"); done < <(printf '%d\n' {0..5})
  declare -p arr
  # declare -a arr='([0]="0" [1]="1" [2]="2" [3]="3" [4]="4" [5]="5")'
#+end_src

#+RESULTS:
: 0" [1]="1" [2]="2" [3]="3" [4]="4" [5]="5

